#include<stdio.h>

//int main()
//{
//	int a=10;
//	float f=10.0;
//	return 0;
//}



//int main()
//{
//	int a=20;
//	//00000000000000000000000000010100--原码
//	//00000000000000000000000000010100--反码
//	//00000000000000000000000000010100--补码
//	//0x 00 00 00 14
//	int b=-10;
//	//10000000000000000000000000001010--原码
//	//11111111111111111111111111110101--反码
//	//11111111111111111111111111110110--补码
//	//0x ff ff ff f6
//	return 0;
//}


//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	int a=1;
//	char* p=(char*)&a;
//	if(*p==1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//int check_sys()
//{
//	int a=1;
//	return *(char*)&a;
//}
//int main()
//{
//	//写一段代码告诉我们当前机器的字节序是什么
//	//返回1，小端
//	//返回0，大端
//	int ret=check_sys();
//	if(ret==1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	int a=0x11223344;
//	char* p=&a;
//	*p=0;
//	return 0;
//}

int main()
{
    char a= -1;
	//10000000000000000000000000000001
	//11111111111111111111111111111110
	//11111111111111111111111111111111
	//11111111-char a
	//11111111111111111111111111111111
	//11111111111111111111111111111110
	//10000000000000000000000000000001
    signed char b=-1;
    unsigned char c=-1;
    printf("a=%d,b=%d,c=%d",a,b,c);
    return 0;
}

// int main()
//{
//    char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000-补码
//	//10000000-char a
//	//打印整型提升（看这个变量本身是不是有符号数的负数），打印原码
//	//11111111111111111111111110000000-补码
//	//打印无符号数，原反补相同
//    printf("%u\n",a);
//    return 0;
//}
